app/views/lessons/show.html.erb

SELECT  "videos".* FROM "videos" WHERE "videos"."lesson_id" = ? AND "videos"."id" = ? LIMIT ?  [["lesson_id", 2], ["id", 2], ["LIMIT", 1]]
---

<% if @lesson.video.present? %>