app/controllers/categories_controller.rb

  def show
    @category = Category.find(params[:id])
    @lesson = Lesson.where(params[:category_id])
    @video = Video.where(params[:lesson_id])
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "lessons".* FROM "lessons" WHERE "lessons"."category_id" = ? AND "lessons"."id" = ? LIMIT ?  [["category_id", 2], ["id", 2], ["LIMIT", 1]]
SELECT  "videos".* FROM "videos" WHERE "videos"."lesson_id" = ? AND "videos"."id" = ? LIMIT ?  [["lesson_id", 2], ["id", 2], ["LIMIT", 1]]