app/controllers/lessons_controller.rb

SELECT "lessons".* FROM "lessons" WHERE "lessons"."published" = ?  [["published", true]]
---
    def index
      @video = Video.where(params[:lesson_id]).all
      @lessons = Lesson.includes(:videos).all.where(published: true)