app/controllers/lessons_controller.rb

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT  "lessons".* FROM "lessons" WHERE "lessons"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT "videos".* FROM "videos" WHERE "videos"."lesson_id" IN (1, 2, 3)
---
  def index
    @category = Category.find(params[:category_id])
    @lessons = @category.lessons.all(lesson_params)
    @video = @lessons.videos.all(video_params)

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "lessons".* FROM "lessons" WHERE "lessons"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "videos".* FROM "videos" WHERE "videos"."lesson_id" = ? AND "videos"."id" = ? LIMIT ?  [["lesson_id", 2], ["id", 2], ["LIMIT", 1]]
---
  def show
    @category = Category.find(params[:id])
    @lesson = Lesson.find(params[:id])
    @video = Video.where(params[:lesson_id])