app/views/categories/show.html.erb


  <% @category.lessons.each do |lesson| %>
---
SELECT "lessons".* FROM "lessons" WHERE "lessons"."category_id" = ?  [["category_id", 1]]